; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/blocksworld/domain.pddl
;;
(define (domain blocksworld)

(:requirements :strips)

(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=22, out_folder=training/easy, instance_id=76, seed=103

(define (problem blocksworld-76)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 - object)
 (:init 
    (arm-empty)
    (clear b5)
    (on b5 b9)
    (on b9 b10)
    (on b10 b6)
    (on b6 b21)
    (on b21 b17)
    (on b17 b12)
    (on b12 b1)
    (on b1 b19)
    (on b19 b20)
    (on b20 b18)
    (on b18 b8)
    (on b8 b2)
    (on b2 b16)
    (on b16 b14)
    (on b14 b11)
    (on b11 b22)
    (on b22 b13)
    (on b13 b4)
    (on b4 b3)
    (on b3 b7)
    (on b7 b15)
    (on-table b15))
 (:goal  (and 
    (clear b4)
    (on b4 b12)
    (on b12 b19)
    (on b19 b15)
    (on b15 b1)
    (on-table b1)
    (clear b13)
    (on b13 b14)
    (on b14 b11)
    (on b11 b6)
    (on b6 b8)
    (on b8 b18)
    (on b18 b20)
    (on b20 b9)
    (on b9 b21)
    (on b21 b3)
    (on b3 b5)
    (on b5 b16)
    (on-table b16)
    (clear b2)
    (on b2 b10)
    (on b10 b22)
    (on-table b22)
    (clear b7)
    (on b7 b17)
    (on-table b17))))

; plan
1. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 1 of 26
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 26
3. (unstack b9 b10)
   deleted: (on b9 b10) (clear b9) (arm-empty)
   added: (holding b9) (clear b10)
   goals met: 1 of 26
4. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 26
5. (unstack b10 b6)
   deleted: (on b10 b6) (clear b10) (arm-empty)
   added: (holding b10) (clear b6)
   goals met: 1 of 26
6. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 26
7. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 1 of 26
8. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 26
9. (unstack b21 b17)
   deleted: (on b21 b17) (clear b21) (arm-empty)
   added: (holding b21) (clear b17)
   goals met: 1 of 26
10. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 26
11. (unstack b17 b12)
   deleted: (on b17 b12) (clear b17) (arm-empty)
   added: (holding b17) (clear b12)
   goals met: 1 of 26
12. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 26
13. (unstack b12 b1)
   deleted: (on b12 b1) (clear b12) (arm-empty)
   added: (holding b12) (clear b1)
   goals met: 2 of 26
14. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 26
15. (unstack b1 b19)
   deleted: (on b1 b19) (clear b1) (arm-empty)
   added: (holding b1) (clear b19)
   goals met: 2 of 26
16. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 26
17. (unstack b19 b20)
   deleted: (on b19 b20) (clear b19) (arm-empty)
   added: (holding b19) (clear b20)
   goals met: 3 of 26
18. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 3 of 26
19. (unstack b20 b18)
   deleted: (on b20 b18) (clear b20) (arm-empty)
   added: (holding b20) (clear b18)
   goals met: 3 of 26
20. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 3 of 26
21. (unstack b18 b8)
   deleted: (on b18 b8) (clear b18) (arm-empty)
   added: (holding b18) (clear b8)
   goals met: 3 of 26
22. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 3 of 26
23. (unstack b8 b2)
   deleted: (on b8 b2) (clear b8) (arm-empty)
   added: (holding b8) (clear b2)
   goals met: 4 of 26
24. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 4 of 26
25. (unstack b2 b16)
   deleted: (on b2 b16) (clear b2) (arm-empty)
   added: (holding b2) (clear b16)
   goals met: 3 of 26
26. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 26
27. (unstack b16 b14)
   deleted: (on b16 b14) (clear b16) (arm-empty)
   added: (holding b16) (clear b14)
   goals met: 4 of 26
28. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 5 of 26
29. (unstack b14 b11)
   deleted: (on b14 b11) (clear b14) (arm-empty)
   added: (holding b14) (clear b11)
   goals met: 4 of 26
30. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 4 of 26
31. (unstack b11 b22)
   deleted: (on b11 b22) (clear b11) (arm-empty)
   added: (holding b11) (clear b22)
   goals met: 4 of 26
32. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 26
33. (unstack b22 b13)
   deleted: (on b22 b13) (clear b22) (arm-empty)
   added: (holding b22) (clear b13)
   goals met: 5 of 26
34. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 6 of 26
35. (unstack b13 b4)
   deleted: (on b13 b4) (clear b13) (arm-empty)
   added: (holding b13) (clear b4)
   goals met: 6 of 26
36. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 7 of 26
37. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 6 of 26
38. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 7 of 26
39. (unstack b3 b7)
   deleted: (on b3 b7) (clear b3) (arm-empty)
   added: (holding b3) (clear b7)
   goals met: 8 of 26
40. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 8 of 26
41. (unstack b7 b15)
   deleted: (on b7 b15) (clear b7) (arm-empty)
   added: (holding b7) (clear b15)
   goals met: 7 of 26
42. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 26
43. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 8 of 26
44. (stack b5 b16)
   deleted: (clear b16) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b16)
   goals met: 9 of 26
45. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 8 of 26
46. (stack b7 b17)
   deleted: (clear b17) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b17)
   goals met: 10 of 26
47. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 10 of 26
48. (stack b10 b22)
   deleted: (clear b22) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b22)
   goals met: 11 of 26
49. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 11 of 26
50. (stack b15 b1)
   deleted: (clear b1) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b1)
   goals met: 12 of 26
51. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 12 of 26
52. (stack b19 b15)
   deleted: (clear b15) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b15)
   goals met: 13 of 26
53. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 12 of 26
54. (stack b2 b10)
   deleted: (clear b10) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b10)
   goals met: 14 of 26
55. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 14 of 26
56. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 15 of 26
57. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 15 of 26
58. (stack b12 b19)
   deleted: (clear b19) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b19)
   goals met: 16 of 26
59. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 16 of 26
60. (stack b21 b3)
   deleted: (clear b3) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b3)
   goals met: 17 of 26
61. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 16 of 26
62. (stack b4 b12)
   deleted: (clear b12) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b12)
   goals met: 18 of 26
63. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 18 of 26
64. (stack b9 b21)
   deleted: (clear b21) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b21)
   goals met: 19 of 26
65. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 19 of 26
66. (stack b20 b9)
   deleted: (clear b9) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b9)
   goals met: 20 of 26
67. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 20 of 26
68. (stack b18 b20)
   deleted: (clear b20) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b20)
   goals met: 21 of 26
69. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 21 of 26
70. (stack b8 b18)
   deleted: (clear b18) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b18)
   goals met: 22 of 26
71. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 22 of 26
72. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 23 of 26
73. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 23 of 26
74. (stack b11 b6)
   deleted: (clear b6) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b6)
   goals met: 24 of 26
75. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 24 of 26
76. (stack b14 b11)
   deleted: (clear b11) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b11)
   goals met: 25 of 26
77. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 24 of 26
78. (stack b13 b14)
   deleted: (clear b14) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b14)
   goals met: 26 of 26
